---
type: CurveArrArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CurveArrArray

`Autodesk.Revit.DB.CurveArrArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurveArrArray | — | `public CurveArrArray ()` |
| Method | Append | — | `public virtual void Append ( CurveArray item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual CurveArrArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( CurveArray item , int index )` |
| Method | ReverseIterator | — | `public virtual CurveArrArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual CurveArray this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |